Revit 2023 API
FabricationPart.RotateConnectedTap Method
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016 Subscription Release
Syntax
C#
public static void RotateConnectedTap(
	Document doc,
	FabricationPart tap,
	double primaryAxisRotateBy,
	double secondaryAxisRotateBy
)
Visual Basic
Public Shared Sub RotateConnectedTap ( _
	doc As Document, _
	tap As FabricationPart, _
	primaryAxisRotateBy As Double, _
	secondaryAxisRotateBy As Double _
)
Visual C++
public:
static void RotateConnectedTap(
	Document^ doc,
	FabricationPart^ tap,
	double primaryAxisRotateBy,
	double secondaryAxisRotateBy
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document.
tap
Type: Autodesk.Revit.DB.FabricationPart
 The connected fabrication part tap to rotate.
primaryAxisRotateBy
Type: System.Double
 The primary axis rotation angle in radians to rotate by.
secondaryAxisRotateBy
Type: System.Double
 The secondary axis rotation angle in radians to rotate by.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Is not connected as a fabrication part tap. -or- tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy -or- tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace